import styles from "./styles.module.css";
import { PageProps } from "../../types";

export default function YehuditBJokePage({ onBack }: PageProps) {
  return (
    <div className={`joke-page ${styles.jokePage}`}>
    <p>הטרמפיסט</p>
       <p className={styles.jokeText}>
        {`שוטר עוצר נהג שנוסע במהירות מטורפת בכביש המהיר. הוא ניגש לחלון ומסתכל פנימה – במושב האחורי יושב פינגווין.

        השוטר ההמום אומר: "אדוני, מה זה צריך להיות?! קח את הפינגווין הזה מיד לגן החיות!"

       הנהג נבהל ואומר: "כן, כן, צודק,אני נוסע לשם עכשיו."

        למחרת, אותו שוטר עומד באותו כביש, ושוב רואה את אותו נהג טס במהירות. הוא עוצר אותו, מביט פנימה – והפינגווין עדיין שם במושב האחורי, אבל הפעם הוא מרכיב משקפי שמש.

        השוטר צועק: "לא אמרתי לך לקחת אותו אתמול לגן החיות?!"

        הנהג עונה: "בטח שלקחתי! הוא כל כך נהנה, שהיום אנחנו הולכים לים!"`}
        </p>
      <button onClick={onBack}>← חזרה</button>
    </div>
  );
}